# Pandas

## Reading

In [4]:
import pandas as pd
'''
sep — the delimiter that is used (default ',').
header — the row number that stores the column headers. By default, pandas tries to infer them from the first row.
names — a list of column names. If you want to use other column names, set header=0 and pass a list of new column 
names with names.
'''
students = pd.read_csv('students.csv', header=0, names=['FN', 'LN', 'N'])

In [5]:
students

      FN      LN   N
0  Terry     Lee  29
1   June     Kim  38
2  Kevin   Zhang  25
3  Julie   Davis  40

In [6]:
# use the specific columns
students_one = pd.read_csv('students.csv', usecols=[0, 2])

In [9]:
students_one

  First name   Age
0      Terry    29
1       June    38
2      Kevin    25
3      Julie    40

In [10]:
# create dataframe from numpy arrays
student_index = [100, 200, 300, 400]
students_list = [['Anna', 'Smith', 21],
                 ['Bob', 'Jones', 20],
                 ['Maria', 'Williams', 25],
                 ['Jack', 'Brown', 22]]
students_two = pd.DataFrame(students_list, columns=['FirstName', 'LastName', 'Age'], index=student_index)

In [11]:
students_two

    FirstName  LastName  Age
100      Anna     Smith   21
200       Bob     Jones   20
300     Maria  Williams   25
400      Jack     Brown   22

In [12]:
# check dimensions
students_two.shape

(4, 3)

In [14]:
# checking head / tail
students_two.head(2)

    FirstName LastName  Age
100      Anna    Smith   21
200       Bob    Jones   20

In [16]:
# check as Series from DataFrame
students['N']

0    29
1    38
2    25
3    40
Name: N, dtype: int64

In [19]:
# check as DataFrame of selected columns
students_two[['FirstName', 'Age']]

    FirstName  Age
100      Anna   21
200       Bob   20
300     Maria   25
400      Jack   22

In [20]:
# check as DataFrame of a single column
students_two[['LastName']]

     LastName
100     Smith
200     Jones
300  Williams
400     Brown

In [21]:
# check as numpy array of a single column
students_two['FirstName'].values

array(['Anna', 'Bob', 'Maria', 'Jack'], dtype=object)

In [25]:
# check as numpy array for multiple columns in different order
students_two[['Age', 'FirstName']].values

array([[21, 'Anna'],
       [20, 'Bob'],
       [25, 'Maria'],
       [22, 'Jack']], dtype=object)